/*
 * @lc app=leetcode.cn id=37 lang=golang
 *
 * [37] 解数独
 *
 * https://leetcode.cn/problems/sudoku-solver/description/
 *
 * algorithms
 * Hard (67.57%)
 * Likes:    1349
 * Dislikes: 0
 * Total Accepted:    160.7K
 * Total Submissions: 237.8K
 * Testcase Example:  '[["5","3",".",".","7",".",".",".","."],["6",".",".","1","9","5",".",".","."],[".","9","8",".",".",".",".","6","."],["8",".",".",".","6",".",".",".","3"],["4",".",".","8",".","3",".",".","1"],["7",".",".",".","2",".",".",".","6"],[".","6",".",".",".",".","2","8","."],[".",".",".","4","1","9",".",".","5"],[".",".",".",".","8",".",".","7","9"]]'
 *
 * 编写一个程序，通过填充空格来解决数独问题。
 *
 * 数独的解法需 遵循如下规则：
 *
 *
 * 数字 1-9 在每一行只能出现一次。
 * 数字 1-9 在每一列只能出现一次。
 * 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
 *
 *
 * 数独部分空格内已填入了数字，空白格用 '.' 表示。
 *
 *
 *
 *
 *
 *
 * 示例 1：
 *
 *
 * 输入：board =
 * [["5","3",".",".","7",".",".",".","."],["6",".",".","1","9","5",".",".","."],[".","9","8",".",".",".",".","6","."],["8",".",".",".","6",".",".",".","3"],["4",".",".","8",".","3",".",".","1"],["7",".",".",".","2",".",".",".","6"],[".","6",".",".",".",".","2","8","."],[".",".",".","4","1","9",".",".","5"],[".",".",".",".","8",".",".","7","9"]]
 *
 * 输出：[["5","3","4","6","7","8","9","1","2"],["6","7","2","1","9","5","3","4","8"],["1","9","8","3","4","2","5","6","7"],["8","5","9","7","6","1","4","2","3"],["4","2","6","8","5","3","7","9","1"],["7","1","3","9","2","4","8","5","6"],["9","6","1","5","3","7","2","8","4"],["2","8","7","4","1","9","6","3","5"],["3","4","5","2","8","6","1","7","9"]]
 * 解释：输入的数独如上图所示，唯一有效的解决方案如下所示：
 *
 *
 *
 *
 *
 *
 * 提示：
 *
 *
 * board.length == 9
 * board[i].length == 9
 * board[i][j] 是一位数字或者 '.'
 * 题目数据 保证 输入数独仅有一个解
 *
 *
 *
 *
 *
 */
package lc37

// @lc code=start
// 和36题场景相反。
func solveSudoku(board [][]byte) {
	backtrack(board, 0, 0)
}

// 原地修改board
// 回溯，从左到右，从上到下
func backtrack(board [][]byte, i, j int) bool {
	if i == 9 { // 整个9行已经遍历完
		return true
	}
	if j == 9 { // 遍历到最右边，跳到下一行
		return backtrack(board, i+1, 0)
	}
	if board[i][j] != '.' { // 非空，跳过
		return backtrack(board, i, j+1)
	}
	for k := byte('1'); k <= byte('9'); k++ {
		if !isValid(board, i, j, k) {
			continue
		}

		board[i][j] = k

		if backtrack(board, i, j+1) { // 找到可行解，直接结束
			return true
		}

		board[i][j] = '.'
	}
	// 穷举完1-9，仍然没找到解
	return false
}

func isValid(board [][]byte, i, j int, ch byte) bool {
	for k := 0; k < 9; k++ {
		if board[i][k] == ch {
			return false
		}
		if board[k][j] == ch {
			return false
		}
		if board[i/3*3+k/3][j/3*3+k%3] == ch { // 妙哇，判断3*3方格是否有重复
			return false
		}
	}
	return true
}

// @lc code=end
